<?php
// PHP7/HTML5, EDGE/CHROME                         *** DoorTryerMessage.php ***

// ****************************************************************************
// * doortry.ru                        Вывести сообщение об ошибке/исключении *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  10.04.2019
// Copyright © 2019 tve                              Посл.изменение: 31.05.2019

/**
 * Сообщение об ошибке или исключении собирается на основании 5 параметров:
 * $errstr - текст сообщения; $errtype - тип сообщения; $errline - строка 
 * сценария, где произошла ошибка или исключение; $errfile - файл сценария; 
 * $errtrace - трассировка всплывания сообщения
**/
// ------------------------------------------ Используемые регулярные выражения
// "фрагмент с типом ошибки с начала строки до ":"
define ("regErrorType",   "/^[A-Za-z_]{1,}:/u");
// "префикс ошибки" с начала строки
define ("regPrefix",      "/^\[[A-Za-z_А-Яа-яЁё\s()]{1,}\]/u");
// "фрагмент трассировки с начала строки до "thrown"
define ("regThrown",      "/^[\s\S]{1,}thrown/u");
// "фрагмент от "#2" до конца строки
define ("regTrace2",      "/#2[\s\S]{1,}$/u");
// "фрагмент трассировки в сообщении об ошибке"
define ("regTrace",       "/Stack trace:[\s\S]{1,}$/u");

// ****************************************************************************
// *    Выбрать из строки подстроку, соответствующую регулярному выражению    *                          *
// ****************************************************************************
function findes($preg,$string,&$point=0)
{
   $findes='';
   $value=preg_match($preg,$string,$matches,PREG_OFFSET_CAPTURE);
   if ($value>0)
   {
      $findes=$matches[0][0];
      $point=$matches[0][1];
   }
   return $findes;
}
// ****************************************************************************
// *                     Вывести сообщение об ошибке/исключении               *
// ****************************************************************************
function DoorTryMessage($ierrstr,$errtype,$errline='',$errfile='',$errtrace='')
{
   $errstr=$ierrstr;
   // Добавляем префикс "PHP", если он отсутствует
   $Prefix=findes(regPrefix,$errstr,$point);
   if ($Prefix=='') $errstr='[PHP] '.$ierrstr;
   // Выводим сообщение об ошибке/исключении
   echo '<div style="border-style:inset; border-width:2">';
   echo "<pre>";
   echo "<b>".$errstr."</b><br><br>";
   echo "File: ".$errfile."<br>";
   echo "Line: ".$errline."<br><br>";
   echo $errtype."<br>";
   if (!($errtrace=='')) {echo $errtrace."<br>";}
   echo "</pre>";
   echo "</div>";
}
// *************************************************** DoorTryerMessage.php ***
